       IDENTIFICATION DIVISION.
       PROGRAM-ID. MainPgm.

       DATA DIVISION.
       working-storage section.


      *Circular reference from MainType -> DepA -> DepB -> MainType
      *Will be used by a variable
       01 MainType1 TYPEDEF STRICT PUBLIC.
            05 var1-1 pic X.
            05 var1-2 type DepA::Type1.
       01 foo1 type MainType1.

      *Circular reference from MainType -> DepA -> DepB -> MainType
      *Will be used by a procedure parameter
       01 MainType2 TYPEDEF STRICT PUBLIC.
            05 var2-1 pic X.
            05 var2-2 type DepA::Type2.

      *Circular reference
      *MainType -> DepA -> DepB -> MainType (unused types)
       01 UnusedMainType3 TYPEDEF STRICT PUBLIC.
            05 var3-1 pic X.
            05 var3-2 type DepA::UnusedType3.


      *Circular reference from MainType -> DepB -> DepA -> MainType
      *Will be used by a variable
       01 MainType11 TYPEDEF STRICT PUBLIC.
            05 var11-1 pic X.
            05 var11-2 type DepB::Type11.
       01 foo10 type DepB::Type11.

      *Circular reference from MainType -> DepB -> DepA -> MainType
      *Will be used by a procedure parameter
       01 MainType12 TYPEDEF STRICT PUBLIC.
            05 var12-1 pic X.
            05 var2-2 type DepB::Type12.

      *Circular reference
      *MainType -> DepB -> DepA -> MainType (unused types)
       01 UnusedMainType13 TYPEDEF STRICT PUBLIC.
            05 var13-1 pic X.
            05 var13-2 type DepB::UnusedType13.



       PROCEDURE DIVISION.
           move foo1::var1-1 to var1-1
           move foo10::var10-1 to var-10-1

           .
       declare procedure UseMainType2 private
          input param2-1        TYPE MainType2
         .
       PROCEDURE DIVISION.
           CONTINUE.
       END-DECLARE.

       declare procedure UseDepBType12 private
          input param12-1        TYPE DepB::Type12
         .
       PROCEDURE DIVISION.
           CONTINUE.
       END-DECLARE.
       
       END PROGRAM MainPgm.
